Repository: Mongez-App/Mongez-ios
Catalog: Mongez/Localizable.xcstrings
Source language: en
Languages: ar

source: (at least 1 required)
ar: (مطلوب واحد على الأقل)

source: (PDFs, slides, notes)
ar: (ملفات PDF، شرائح، ملاحظات)

source: 5 hours / day
ar: 5 ساعات / يوم

source: Add Course
ar: إضافة دورة

source: Add Event
ar: إضافة حدث

source: Add Material
ar: إضافة مادة

source: Add New Course
ar: إضافة دورة جديدة

source: AI creates your perfect study schedule automatically.
ar: يقوم الذكاء الاصطناعي بإنشاء جدول مذاكرة مثالي لك تلقائيًا.

source: AI Suggestion
ar: اقتراح الذكاء الاصطناعي

source: Alert
ar: تنبيه

source: Already have an account?
ar: لديك حساب بالفعل؟

source: Appearance
ar: المظهر

source: Are you sure you want to delete this course?
ar: هل أنت متأكد أنك تريد حذف هذه الدورة؟

source: Are you sure you want to delete this material?
ar: هل أنت متأكد أنك تريد حذف هذه المادة؟

source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Ask your AI tutor
ar: اسأل معلمك الذكي

source: Calendar Sync
ar: مزامنة التقويم

source: Cancel
ar: إلغاء

source: Choose an Avatar
ar: اختر صورة رمزية

source: Completed Tasks
ar: المهام المكتملة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Confirmation
ar: تأكيد

source: Connect your Apple Calendar so AI can avoid conflicts and create the best schedule for you.
ar: اربط تقويم Apple الخاص بك ليتمكن الذكاء الاصطناعي من تجنب التعارضات وإنشاء أفضل جدول دراسي لك.

source: Continue with Google
ar: المتابعة باستخدام جوجل

source: Course
ar: المادة

source: Course Code (Optional)
ar: رمز الدورة (اختياري)

source: Course Material
ar: مادة الدورة

source: Course Name
ar: اسم الدورة

source: Course Progress
ar: تقدم الدورة

source: Course URL
ar: رابط الدورة

source: Courses
ar: الدورات

source: Create account
ar: إنشاء حساب

source: Creating course...
ar: جارٍ إنشاء الدورة...

source: Creating...
ar: جارٍ الإنشاء...

source: Dark
ar: داكن

source: Date & Time
ar: التاريخ والوقت

source: Day
ar: يوم

source: Deadline (Exam Date)
ar: الموعد النهائي (تاريخ الامتحان)

source: Delete
ar: حذف

source: Delete Course
ar: حذف الدورة

source: Delete Course?
ar: هل تريد حذف الدورة؟

source: Delete Material
ar: حذف المادة

source: Disconnect
ar: قطع الاتصال

source: Discover
ar: استكشاف

source: Don't have an account?
ar: ليس لديك حساب؟

source: Done
ar: تم

source: e.g. CS301
ar: مثال: CS301

source: e.g. Midterm Exam
ar: مثال: امتحان منتصف الفصل

source: e.g. Operating Systems
ar: مثال: أنظمة التشغيل

source: Edit Course
ar: تعديل الدورة

source: Edit Preferences
ar: تعديل التفضيلات

source: Edit Profile
ar: تعديل الملف الشخصي

source: Email
ar: البريد الإلكتروني

source: End session
ar: إنهاء الجلسة

source: End this session?
ar: هل تريد إنهاء هذه الجلسة؟

source: English
ar: الإنجليزية

source: Enter Invite Code or Team ID
ar: أدخل كود الدعوة أو معرّف الفريق

source: Enter Team name here
ar: أدخل اسم الفريق هنا

source: Enter your name
ar: أدخل اسمك

source: Error
ar: خطأ

source: Event Type
ar: نوع الحدث

source: Event Types
ar: أنواع الأحداث

source: Events
ar: الأحداث

source: F
ar: ج

source: Failed to load PDF
ar: فشل تحميل ملف PDF

source: Filter Roadmap
ar: تصفية الخطة الدراسية

source: Full Name
ar: الاسم الكامل

source: Get Started
ar: ابدأ الآن

source: Go to Settings
ar: الذهاب إلى الإعدادات

source: Got It
ar: حسنًا

source: Hours
ar: الساعات

source: How many hours would you study daily ?
ar: كم عدد الساعات التي ستدرسها يوميًا؟

source: How many hours would you study daily?
ar: كم ساعة تريد أن تذاكر يوميًا؟

source: Image selected
ar: تم اختيار الصورة

source: John Doe
ar: أحمد محمد

source: Join Your First Team
ar: انضم إلى أول فريق لك

source: Keep Studying
ar: متابعة الدراسة

source: Language
ar: اللغة

source: Learn with your personal AI tutor
ar: تعلّم مع معلمك الخاص المدعوم بالذكاء الاصطناعي

source: Let's continue our study journey
ar: لنكمل رحلتنا الدراسية

source: Let's hit today's tasks
ar: لننجز مهام اليوم

source: Let's Start
ar: لنبدأ

source: Light
ar: فاتح

source: Logout
ar: تسجيل الخروج

source: M
ar: ن

source: Materials
ar: المواد

source: Mon
ar: إثن

source: Monthly Progress
ar: التقدم الشهري

source: My Courses
ar: دوراتي

source: My Teams
ar: فرقي

source: Name
ar: الاسم

source: Next
ar: التالي

source: No completed tasks.
ar: لا توجد مهام مكتملة.

source: No courses added yet
ar: لم تتم إضافة أي مواد بعد

source: No courses yet
ar: لا توجد دورات بعد

source: No Courses Yet
ar: لا توجد دورات بعد

source: No date range selected
ar: لم يتم تحديد نطاق تاريخ

source: No events scheduled for this block yet.
ar: لا توجد أحداث مجدولة لهذه الفترة بعد.

source: No Events Yet
ar: لا توجد أحداث بعد

source: No high priority tasks.
ar: لا توجد مهام ذات أولوية عالية.

source: No low priority tasks.
ar: لا توجد مهام ذات أولوية منخفضة.

source: No materials have been uploaded yet.
ar: لم يتم رفع أي مواد بعد.

source: No medium priority tasks.
ar: لا توجد مهام ذات أولوية متوسطة.

source: No pending tasks found.
ar: لا توجد مهام قيد الانتظار.

source: No results found
ar: لم يتم العثور على نتائج

source: No study blocks generated yet Start by adding some courses and events!
ar: لم يتم إنشاء أي خطة مذاكرة بعد ابدأ بإضافة بعض المواد والأحداث!

source: No study blocks yet. Add an event or task to get started!
ar: لا توجد فترات مذاكرة بعد. أضف حدثًا أو مهمة للبدء!

source: No tasks for today!
ar: لا توجد مهام لهذا اليوم!

source: No tasks found in this course.
ar: لا توجد مهام في هذه الدورة.

source: No tasks found.
ar: لا توجد مهام.

source: No tasks scheduled for this block yet.
ar: لا توجد مهام مجدولة لهذه الفترة بعد.

source: No Teams Found
ar: لم يتم العثور على فرق

source: No Teams Yet
ar: لا توجد فرق بعد

source: OK
ar: حسنًا

source: Online Course
ar: دورة عبر الإنترنت

source: or
ar: أو

source: Organizations
ar: المؤسسات

source: Password
ar: كلمة المرور

source: Pause session
ar: إيقاف الجلسة مؤقتًا

source: Pause this session?
ar: هل تريد إيقاف هذه الجلسة مؤقتًا؟

source: Pending Invitations
ar: الدعوات المعلّقة

source: PNG or JPG, up to 5 MB
ar: PNG أو JPG، حتى 5 ميجابايت

source: Previous
ar: السابق

source: Progress
ar: التقدم

source: Reset
ar: إعادة تعيين

source: Retry
ar: إعادة المحاولة

source: Roadmap
ar: الخطة الدراسية

source: S
ar: ح

source: Save
ar: حفظ

source: Save Changes
ar: حفظ التغييرات

source: Search courses...
ar: البحث عن الدورات...

source: Select all that apply
ar: اختر كل ما ينطبق

source: Selected:
ar: المحدد:

source: Sign In
ar: تسجيل الدخول

source: Sign up
ar: إنشاء حساب

source: Sign Up
ar: إنشاء حساب

source: Skip
ar: تخطي

source: Skip for now
ar: تخطي الآن

source: Start Date
ar: تاريخ البدء

source: Start your learning journey by adding your first course
ar: ابدأ رحلتك التعليمية بـ إضافة أول دورة لك

source: Start your smart learning journey
ar: ابدأ رحلتك التعليمية الذكية

source: Status
ar: الحالة

source: Streak
ar: المواظبة

source: Streak Days
ar: أيام المواظبة

source: Study Days
ar: أيام المذاكرة

source: Study materials for online courses are managed externally.
ar: يتم إدارة المواد الدراسية للدورات الإلكترونية خارجيًا.

source: Study Time
ar: وقت المذاكرة

source: Study without the stress
ar: المذاكرة بدون توتر

source: Studying Hours
ar: ساعات المذاكرة

source: Summaries, explanation and smart study sessions-all in one place.
ar: ملخصات وشروحات وجلسات مذاكرة ذكية - كل ذلك في مكان واحد.

source: Sun
ar: أحد

source: Sync Apple Calendar
ar: مزامنة تقويم Apple

source: Sync your Calendar
ar: مزامنة تقويمك

source: Sync your calender and let AI fit studying into your free time .
ar: زامن تقويمك ودع الذكاء الاصطناعي يُدرج المذاكرة في أوقات فراغك.

source: System
ar: النظام

source: T
ar: ث

source: Tap to browse files
ar: اضغط لتصفح الملفات

source: Tap to upload image
ar: اضغط لرفع صورة

source: Tasks
ar: المهام

source: Team Progress
ar: تقدّم الفريق

source: This team has no courses currently.
ar: لا يحتوي هذا الفريق على أي دورات حاليًا.

source: This team has no upcoming events.
ar: لا توجد أحداث قادمة لهذا الفريق.

source: Thu
ar: خمي

source: Thumbnail
ar: الصورة المصغرة

source: Title
ar: العنوان

source: Today Tasks
ar: مهام اليوم

source: Today's Focus
ar: تركيز اليوم

source: Today's Goal
ar: هدف اليوم

source: Today's Tasks
ar: مهام اليوم

source: Trending Teams
ar: الفرق الرائجة

source: Try a different search term
ar: جرّب مصطلح بحث مختلف

source: Try a different search term or adjust your filters
ar: جرّب مصطلح بحث مختلف أو عدّل عوامل التصفية

source: Tue
ar: ثلا

source: Turn off Calendar Sync?
ar: إيقاف مزامنة التقويم؟

source: Unfortunately no teams found with the entered name
ar: للأسف لم يتم العثور على فرق بالاسم المدخل

source: Upcoming Deadlines
ar: المواعيد النهائية القادمة

source: Upcoming Tasks
ar: المهام القادمة

source: Upload cover image
ar: رفع صورة الغلاف

source: Upload material
ar: رفع مادة

source: Upload Material
ar: رفع مادة

source: Upload Materials (PDF, PPT, DOC)
ar: رفع المواد (PDF، PPT، DOC)

source: Validation Error
ar: خطأ في التحقق

source: View all
ar: عرض الكل

source: W
ar: ر

source: We'll personalize your plan based on the time you have
ar: سنخصص خطتك بناءً على الوقت المتاح لديك

source: Wed
ar: أرب

source: Weekly Progress
ar: التقدم الأسبوعي

source: Welcome back
ar: مرحبًا بعودتك

source: Which days are available ?
ar: ما هي الأيام المتاحة؟

source: Which days are available?
ar: ما الأيام المتاحة؟

source: Yaaay! you are done with this month's deadlines
ar: رائع! أنهيت كل المواعيد النهائية لهذا الشهر

source: You haven't joined any teams yet. Search for a code or browse public campus groups.
ar: لم تنضم إلى أي فريق بعد. ابحث عن كود أو تصفّح مجموعات الحرم الجامعي العامة.

source: You will need to enter your username and password to sign back in.
ar: ستحتاج إلى إدخال اسم المستخدم وكلمة المرور لتسجيل الدخول مرة أخرى.

source: You're most productive around 7 PM. Start Networking before Algorithms today.
ar: أنت في أعلى إنتاجيتك حول الساعة 7 مساءً. ابدأ بمادة التواصل المهني قبل الخوارزميات اليوم.

source: Your progress will be saved and this task will be marked as complete.
ar: سيتم حفظ تقدمك وسيتم تحديد هذه المهمة كمكتملة.

source: Your progress will be saved but this task will NOT be marked as complete.
ar: سيتم حفظ تقدمك ولكن لن يتم تحديد هذه المهمة كمكتملة.

source: Your schedule is set to default
ar: تم ضبط جدولك على الوضع الافتراضي

source: Your study sessions will stop syncing to your calendar. You can turn this back on anytime.
ar: ستتوقف جلسات المذاكرة عن المزامنة مع تقويمك. يمكنك إعادة التفعيل في أي وقت.

source: Your time, perfetcly optimized
ar: وقتك، مُنظّم بعناية
